Data/TU_Delft_Campus_case/c_2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    x0
    {
        type            symmetry;
    }
    y0
    {
        type            zeroGradient;
    }
    x1
    {
        type            symmetry;
    }
    y1
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
        value           uniform 0;
    }
    terrain
    {
        type            zeroGradient;
    }
    sky
    {
        type            symmetry;
    }
    Buildings
    {
        type            zeroGradient;
    }
    WaterGreen
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
